Տնային <br><br>

<?php

echo '1. Ստեղծիր PHP ֆայլ, որտեղ կօգտագործես երեք տեսակի մեկնաբանություններ (//, #, /* */): <br>';

#  մեկնաբանություն 1
//  մեկնաբանություն 2
/*  մեկնաբանություն 3 */

echo '2. Ստեղծիր 5 փոփոխական (integer, string, boolean, float) և տպիր դրանց արժեքները։  <br><br>';

$x1 = "Hello";
$x2 = 5;
$x3 = true; // 1
$x4 = 4.5;
$x5 = null; // չի տպի
echo "string - $x1,<br> 
integer - $x2,<br> 
boolean - $x3,<br> 
float - $x4,<br>
null - $x5 <br><br>";

echo '3. Փոփոխականներում պահիր քո անունը, ազգանունը և տարիքը, ապա տպիր այս ձևաչափով. Ես [Անուն] [Ազգանուն] եմ և [Տարիք] տարեկան եմ։  <br><br>';

$name = "Սայաթ";
$surname = "Ալեքսանյան";
$age = 27;
echo "Ես $name $surname եմ և $age տարեկան եմ։ <br><br>";

echo '4. Ստեղծիր երկու string փոփոխական և օգտագործիր կոնկատենացիա (.) դրանք միացնելու համար։  <br><br>';

$str1 = "Hello";
$str2 = "World";
echo "$str1" . "$str2" . '<br><br>';

echo '5. Փորձիր փոփոխականներում օգտագործել case sensitivity՝ տարբեր մեծատառ և փոքրատառ տարբերակներ։  <br><br>';

$strCS = "Case Sensitivity";
echo '$strCS - ' . "$strCS" . '<br><br>';

echo '6. Ստեղծիր երկու integer փոփոխական և դրանց վրա կիրառիր բոլոր հիմնական (+, -, *, /, %) գործողությունները։  <br><br>';

$x = 5;
$y = 2;

echo "$x +  $y = " . ($x + $y) . '<br>';
echo "$x -  $y = " . ($x - $y) . '<br>';
echo "$x * $y = " . $x * $y . '<br>';
echo "$x / $y = " . $x / $y . '<br>';
echo "$x % $y = " . $x % $y . '<br><br>';

echo '7. Ստեղծիր փոփոխական $num և նրան 10 ավելացրու += օպերատորով։  <br><br>';

$num = 0;

echo "$num += 10 = " . ($num += 10) . '<br><br>';

echo '8. Ստեղծիր փոփոխական $x = 2, ապա կիրառիր **= օպերատորը 3 արժեքով (այսինքն՝ $x = $x ** 3)։  <br><br>';

$num2 = 2;
echo "$num2 **= 3 = " . ($num2 **= 3) . '<br>';

?>

<br><hr><br>
Լրացուցիչ առաջադրանքներ <br><br>

<?php

echo '1. Ստեղծիր երկու փոփոխական և համեմատիր դրանք ==, !=, >, < օպերատորներով։  <br><br>';

$x_2 = 5;
$y_2 = 2;

echo "$x_2 > $y_2 = " . ($x_2 > $y_2) . '<br>';
echo "$x_2 < $y_2 = " . ($x_2 < $y_2) . '<br>';
echo "$x_2 == $y_2 = " . ($x_2 == $y_2) . '<br>';
echo "$x_2 != $y_2 = " . ($x_2 != $y_2) . '<br>';

echo "<br>";

echo '2. Ստուգիր, արդյո՞ք թիվը զույգ է, թե՞ կենտ (% օպերատորի օգնությամբ)։  <br><br>';

if ($x_2 % 2 == 0) {
    echo "$x_2 թիվը զույգ է <br>";
} else {
    echo "$x_2 թիվը կենտ է <br>";
}

if ($y_2 % 2 == 0) {
    echo "$y_2 թիվը զույգ է <br><br>";
} else {
    echo "$y_2 թիվը կենտ է <br><br>";
}

echo '3. Ստեղծիր փոփոխական $age = 18, և ստուգիր, արդյոք այն մեծ է կամ հավասար 18-ի։  <br><br>';

$age2 = 18;
if ($age2 >= 18) {
    echo "$age2 մեծ կամ հավասար է 18-ի<br><br>";
} else {
    echo "$age2 մեծ չէ 18-ի<br><br>";
}

echo '4. Ստեղծիր փոփոխական $_test և փորձիր այն տպել։ Հասկացիր, թե ինչու են որոշ փոփոխական անուններ ընդունելի, իսկ որոշները՝ ոչ։  <br><br>';

$_test = '_test';
echo $_test . '<br><br>';
echo "Պետք է սկսվի $ նշանով, 
    <br> $ նշանից հետո անունը պետք է սկսվի տառով կամ _ գծիկով, 
    <br> Կարող է պարունակել միայն տառեր, թվեր և _ <br><br>";

echo '5. Ստեղծիր փոփոխական, որը պարունակում է թվային string (օրինակ՝ "100"), ապա այն փոխակերպիր integer-ի ((int))։  <br><br>';

$number = "100";            // string
$converted = (int) $number; // integer

echo "string: $number <br>";
echo "integer: $converted <br><br>";

echo '6. Ստեղծիր երկու փոփոխական, որոնցից մեկը կլինի string, իսկ մյուսը՝ integer, ապա փորձիր դրանք գումարել։ Տես՝ ինչ արդյունք է ստացվում։  <br><br>';

$number2 = 100;
$number3 = "100";

echo "integer: $number2 + string: $number3 = " . "integer: " .($number2 + $number3) . '<br><br>';

echo '7. Ստեղծիր փոփոխական $text = "PHP is awesome!" և օգտագործիր strlen() ֆունկցիան՝ տեքստի երկարությունը գտնելու համար։  <br><br>';

$text = "PHP is awesome!";
$length = strlen($text);

echo "\"PHP is awesome!\" Տողի երկարությունը՝ $length <br><br>";

echo '8. Ստեղծիր փոփոխական $word = "Hello World", ապա օգտագործիր str_replace() ֆունկցիան՝ "World"-ը "PHP"-ով փոխարինելու համար։  <br><br>';

$text = "Hello World";
$newText = str_replace("World", "PHP", $text);

echo $text . ' => ' . $newText;

?>

<br><hr><br>

A <=> B <br>
եթե A < B կստանանք -1,  <br>
եթե A = B կստանանք 0,  <br>
եթե A > B կստանանք 1  <br>
